from itertools import permutations


s = """ар кТпшооло очолк сМ.аа ссцяе е итвл оковн у и,л  гечог ариломз пеяуонлмп ло уа ытх.д урВгакя нрйлп оосп,ео рксееею ещайоп,лп оьемрлн лукае ьнт. врпЯитилас вягз лу  лнвк оно:то-октвиот рнр очпблжеоам ми ог  оеиксырсл  оБягн еазту адк. менЯ глп оог,тааьч от бту оэсеотсщвсаеб жо п лотуевосбгре е;но адкн оаичм еае уенукалб ды аедовь яст."""

s += " " * ((6 - len(s) % 6) % 6)

for p in permutations(range(6)):
    plain = "".join(s[i + x] for i in range(0, len(s), 6) for x in p)
    print(f"Ключ {tuple(x + 1 for x in p)}:\n{plain}\n")
